app/Http/Controllers/User/ProductDetailController.php

    public function getProductDetail(Request $request,ProductInterface $productService, $slug){
        $product = Product::where('slug', '=', $slug)->firstorfail();
---
select * from `products` where `slug` = 'thanhthanh' limit 1