app/Http/Controllers/CartController.php

    public function addProduct(Request $request)
    {
        $product_id = $request->input('product_id');

        if(Auth::check())
        {
            $prod_check = Product::where('id',$product_id)->first();

            if($prod_check)
            {
                if(Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->exists())
                {
                    $cartItem = Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->first();
                    $cartItem->prod_qty = $cartItem->prod_qty + 1;
                    $cartItem->save();
                    return response()->json(['status'=>$prod_check->name."Quantity Update"]);
                }
                else
                {
                    $cartItem = new Cart();
                    $cartItem->prod_id = $product_id;
                    $cartItem->prod_qty = 1;
                    $cartItem->user_id = Auth::id();
                    $cartItem->save();
---
select * from `products` where `id` = '3' limit 1
select exists(select * from `carts` where `prod_id` = '3' and `user_id` = 1) as `exists`
insert into `carts` (`prod_id`, `prod_qty`, `user_id`, `updated_at`, `created_at`) values ('3', 1, 1, '2022-05-17 06:52:38', '2022-05-17 06:52:38')

    public function updateCart(Request $request){

        if(!Auth::check())
        {
            return response()->json(['status'=>"Need login"]);

        }
        $product_id = $request->input('product_id');
        $cartItemQty = $request->input('prod_qty');

        $product = Product::where('id',$product_id)->first();
        $stockQuantity = $product->quantity;
        if($stockQuantity < $cartItemQty )
        {
            return response()->json(['status'=>"Not enough quantity in stock"]);
        }
        if(!Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->first())
        {
            return response()->json(['status'=>"Not found product"]);
        }
        $cart = Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->first();
        $cart->prod_qty = $cartItemQty ;
        $cart->update();
---
update `carts` set `prod_qty` = '3', `carts`.`updated_at` = '2022-05-17 06:35:06' where `id` = 5

    public function deleteProduct(Request $request){
        if(Auth::check())
        {
            $product_id = $request->input('product_id');
            if(Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->exists())
            {
                $cartItem = Cart::where('prod_id',$product_id)->where('user_id',Auth::id())->first();
---
select exists(select * from `carts` where `prod_id` = '2' and `user_id` = 1) as `exists`
select * from `carts` where `prod_id` = '2' and `user_id` = 1 limit 1