app/Http/Controllers/ProductListController.php

select * from `products` order by `id` desc limit 2 offset 0
select count(*) as aggregate from `products`
---
    public function index(){
        $products = Product::orderBy('id','desc')->paginate(2);